
# Создаём вектор и присваиваем переменной
a <- seq(1, 40, by=2)

# Прибавляем значение всем элементам вектора
a + 5

# Умножаем вектор
a * 2

# Сумма элементов
sum(a)

# Наибольший элемент
max(a)

# Наименьший элемент
min(a)

# Returns the product of all the values present in its arguments.
prod(a)

# Длина вектора
length(a)

# Среднее арифметическое
mean(a)

# Получаем дисперсию
var(a)

# Получаем сортированный вектор
sort(a)

# Получаем информацию об обьекте
summary(a)
